# BendingDetailTypeAngularDimensionOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeAngularDimensionOffset Property
ParameterTypeId Class See Also
---
"Angular Dimension Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeAngularDimensionOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace